УТ_для_edt.ДоставкаДеловыеЛинии/src/DataProcessors/ДЛ_Мультизаявка/ДЛ_Мультизаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДЛ_Мультизаявка</name>
</mdclass:DataProcessor>

УТ_для_edt.ДоставкаДеловыеЛинии/src/InformationRegisters/ДЛ_АдреснаяКнига/ДЛ_АдреснаяКнига.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДЛ_АдреснаяКнига</name>
  <attributes>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселнныйПункт</name>
    <type>
      <types>CatalogRef.ДЛ_Города</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчастникГрузоперевозки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.ДоставкаДеловыеЛинии/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.ДоставкаДеловыеЛинии/src/DataProcessors/ДЛ_Мультизаявка/Forms/ВводАдреса/Module.bsl
&НаКлиенте
Процедура ОткрытьФормуВыбораАдреса(Префикс)
	
	ИмяРеквизитаАдреса = Префикс + "Адрес";	
	
	ДополнительныеПараметры = Новый Структура;	
	ДополнительныеПараметры.Вставить("ИмяРеквизитаАдреса", ИмяРеквизитаАдреса);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", 
		ЭтаФорма, ДополнительныеПараметры);
		
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ВидКонтактнойИнформации.Вставить("ТолькоНациональныйАдрес", Ложь);
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформации.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
		
	ПараметрыФормыКонтактнойИнформации = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации,
		ЭтаФорма[ИмяРеквизитаАдреса + "Значение"],
		ЭтаФорма[ИмяРеквизитаАдреса + "Представление"]);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	
	АдресЗначение = ""; 
	
	ПодключитьОбработчикОжидания("СкрытьГруппаАдресПодсказки", 0.2, Истина);
	
КонецПроцедуры   

&НаКлиенте
Процедура СкрытьГруппаАдресПодсказки()
	
	Элементы.ГруппаАдресПодсказки.Видимость = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытияФормы = Новый Структура();
	
	ПараметрыЗакрытияФормы.Вставить("Значение", АдресЗначение);
	ПараметрыЗакрытияФормы.Вставить("Представление", АдресПредставление); 
	ПараметрыЗакрытияФормы.Вставить("Город", Город);
	
	Закрыть(ПараметрыЗакрытияФормы);  
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение", ЭтаФорма);
		
	ВидКонтактнойИнформации = Новый Структура;
	ВидКонтактнойИнформации.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	ВидКонтактнойИнформации.Вставить("ТолькоНациональныйАдрес", Ложь);
	ВидКонтактнойИнформации.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформации.Вставить("СкрыватьНеактуальныеАдреса", Ложь);
		
	ПараметрыФормыКонтактнойИнформации = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
		ВидКонтактнойИнформации,
		АдресЗначение,
		АдресПредставление);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыКонтактнойИнформации,, Оповещение);

	
КонецПроцедуры  

&НаКлиенте	
Процедура ОткрытьФормуВыбораАдресаИОбработатьРезультатЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда  
		
		Возврат; 
		
	КонецЕсли;
	
	АдресПредставление = Результат.Представление;
	АдресЗначение = Результат.Значение; 	

КонецПроцедуры

&НаКлиенте
Процедура АдресОчистка(Элемент, СтандартнаяОбработка)
	
	АдресЗначение = "";
	
КонецПроцедуры


&НаКлиенте
Процедура АдресИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если Текст = АдресПредставление Тогда  
		
		Элементы.ГруппаАдресПодсказки.Видимость = Ложь;  
		
	ИначеЕсли ЗначениеЗаполнено(Город) И СтрДлина(Текст) > 2 Тогда		
		
		АдресИзменениеТекстаРедактированияНаСервере(Текст);			
		
	КонецЕсли;  
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Город = Параметры.Город;
	АдресПредставление = Параметры.АдресПредставление;
	АдресЗначение = Параметры.АдресЗначение;
	КонтрагентСсылка = Параметры.КонтрагентСсылка;
	
КонецПроцедуры                              

&НаСервере
Процедура АдресИзменениеТекстаРедактированияНаСервере(Текст)  	
	
	МассивНаУдаление = Новый Массив;   
	
	ГруппаПодсказки = Элементы.ГруппаАдресПодсказки;
	
	Для Каждого Элемент Из ГруппаПодсказки.ПодчиненныеЭлементы Цикл 
		
		МассивНаУдаление.Добавить(Элемент); 
		
	КонецЦикла;  
	
	Для Каждого Элемент Из МассивНаУдаление Цикл
		
		Элементы.Удалить(Элемент);
		
	КонецЦикла;      
	
	Если СервисПодсказокНеПодключен Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ГруппаПодсказки.Видимость = Истина;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("appKey");
	СтруктураЗапроса.Вставить("sessionID");  
	СтруктураЗапроса.Вставить("query", Текст);
	СтруктураЗапроса.Вставить("mode", "raw"); 
	СтруктураЗапроса.Вставить("count", 10);
	СтруктураЗапроса.Вставить("city_code", Город.КодКЛАДР);  
	
	ДанныеАдресов = ДЛ_ДеловыеЛинии.ПолучитьПодсказкиПоискаАдреса(СтруктураЗапроса); 
	
	МассивАдресов = Новый Массив;
	
	Если ДанныеАдресов["suggestions"] <> Неопределено Тогда
	
		Для Каждого СтруктураАдреса Из ДанныеАдресов["suggestions"] Цикл
			
			МассивАдресов.Добавить(СтруктураАдреса["value"]);	
			
		КонецЦикла;
		
	ИначеЕсли ДанныеАдресов["error"] <> Неопределено 
		И ДанныеАдресов["error"]["description"] = "Отсутствует доступ к методу. Обратитесь в техническую поддержку." Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует доступ к методу получения подсказок ручного ввода адреса. Обратитесь в техническую поддержку.");
		
		СервисПодсказокНеПодключен = Истина;	
		
	КонецЕсли;   
	
	Для Каждого НайденныйАдрес Из МассивАдресов цикл         
		
		ИндексЭлемента = МассивАдресов.Найти(НайденныйАдрес);  
		
		ИмяКоманды = "ЗаполнениеАдресаПоПодсказке" + ИндексЭлемента; 
		
		НоваяКоманда = Команды.Найти(ИмяКоманды);  
		
		Если НоваяКоманда = Неопределено Тогда 
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "ЗаполнениеАдресаПоПодсказке"; 	
			
		КонецЕсли; 
		
		НоваяКоманда.Заголовок = НайденныйАдрес;
		
		НовыйЭлемент = Элементы.Добавить("КнопкаПодсказка" + ИндексЭлемента, Тип("КнопкаФормы"), ГруппаПодсказки);
		НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;		
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнениеАдресаПоПодсказке(Команда) 	
	
	АдресПредставление = ПолучитьЗаголовокКоманды(Команда.Имя);	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьЗаголовокКоманды(ИмяКоманды) 
	
	Команда = Команды.Найти(ИмяКоманды);
	
	Возврат Команда.Заголовок;	
	
КонецФункции

&НаКлиенте
Процедура ГородПриИзменении(Элемент)		
	
	Если ЗначениеЗаполнено(Город) Тогда		
		
		АдресПоАдреснойКниге = ПолучитьАдресПоАдреснойКниге();
		
		Если ЗначениеЗаполнено(АдресПоАдреснойКниге) Тогда
			
			АдресПредставление = АдресПоАдреснойКниге;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресПоАдреснойКниге()
	
	Результат = ""; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЛ_АдреснаяКнига.Адрес КАК Адрес,
	               |	ДЛ_АдреснаяКнига.НаселнныйПункт КАК НаселнныйПункт
	               |ИЗ
	               |	РегистрСведений.ДЛ_АдреснаяКнига КАК ДЛ_АдреснаяКнига
	               |ГДЕ
	               |	ДЛ_АдреснаяКнига.УчастникГрузоперевозки = &УчастникГрузоперевозки	               
	               |	И ДЛ_АдреснаяКнига.НаселнныйПункт = &НаселнныйПункт";
	Запрос.УстановитьПараметр("УчастникГрузоперевозки", КонтрагентСсылка);
	Запрос.УстановитьПараметр("НаселнныйПункт", Город);	
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();		
		
		Результат = Выборка.Адрес;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
